ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/HSM/f29h85x_input_xbar_regs.xml
<module id="INPUT_XBAR_REGS" HW_revision="" description="INPUT XBAR Registers">
	<register id="INPUTSELECT" width="32" page="0" offset="0x0" instances="64" instaddr="4" internal="0" description="Input Select Register (GPIO0 to x)">
		<bitfield id="SELECT" description="Select GPIO for INPUT{#} signal" begin="15" end="0" width="16" rwaccess="RW"/>
	</register>
	<register id="INPUTSELECTLOCK1" width="32" page="0" offset="0x400" instances="1" instaddr="4" internal="0" description="Input Select Lock Register 1">
		<bitfield id="INPUT1SELECT" description="Lock bit for INPUT1SELECT Register" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="INPUT2SELECT" description="Lock bit for INPUT2SELECT Register" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="INPUT3SELECT" description="Lock bit for INPUT3SELECT Register" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="INPUT4SELECT" description="Lock bit for INPUT4SELECT Register" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="INPUT5SELECT" description="Lock bit for INPUT5SELECT Register" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="INPUT6SELECT" description="Lock bit for INPUT6SELECT Register" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="INPUT7SELECT" description="Lock bit for INPUT7SELECT Register" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="INPUT8SELECT" description="Lock bit for INPUT8SELECT Register" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="INPUT9SELECT" description="Lock bit for INPUT9SELECT Register" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="INPUT10SELECT" description="Lock bit for INPUT10SELECT Register" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="INPUT11SELECT" description="Lock bit for INPUT11SELECT Register" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="INPUT12SELECT" description="Lock bit for INPUT12SELECT Register" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="INPUT13SELECT" description="Lock bit for INPUT13SELECT Register" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="INPUT14SELECT" description="Lock bit for INPUT14SELECT Register" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="INPUT15SELECT" description="Lock bit for INPUT15SELECT Register" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="INPUT16SELECT" description="Lock bit for INPUT16SELECT Register" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="INPUT17SELECT" description="Lock bit for INPUT17SELECT Register" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="INPUT18SELECT" description="Lock bit for INPUT18SELECT Register" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="INPUT19SELECT" description="Lock bit for INPUT19SELECT Register" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="INPUT20SELECT" description="Lock bit for INPUT20SELECT Register" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="INPUT21SELECT" description="Lock bit for INPUT21SELECT Register" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="INPUT22SELECT" description="Lock bit for INPUT22SELECT Register" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="INPUT23SELECT" description="Lock bit for INPUT23SELECT Register" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="INPUT24SELECT" description="Lock bit for INPUT24SELECT Register" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="INPUT25SELECT" description="Lock bit for INPUT25SELECT Register" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="INPUT26SELECT" description="Lock bit for INPUT26SELECT Register" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="INPUT27SELECT" description="Lock bit for INPUT27SELECT Register" begin="26" end="26" width="1" rwaccess="RW"/>
		<bitfield id="INPUT28SELECT" description="Lock bit for INPUT28SELECT Register" begin="27" end="27" width="1" rwaccess="RW"/>
		<bitfield id="INPUT29SELECT" description="Lock bit for INPUT29SELECT Register" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="INPUT30SELECT" description="Lock bit for INPUT30SELECT Register" begin="29" end="29" width="1" rwaccess="RW"/>
		<bitfield id="INPUT31SELECT" description="Lock bit for INPUT31SELECT Register" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="INPUT32SELECT" description="Lock bit for INPUT32SELECT Register" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="INPUTSELECTLOCK2" width="32" page="0" offset="0x404" instances="1" instaddr="4" internal="0" description="Input Select Lock Register 2">
		<bitfield id="INPUT33SELECT" description="Lock bit for INPUT33SELECT Register" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="INPUT34SELECT" description="Lock bit for INPUT34SELECT Register" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="INPUT35SELECT" description="Lock bit for INPUT35SELECT Register" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="INPUT36SELECT" description="Lock bit for INPUT36SELECT Register" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="INPUT37SELECT" description="Lock bit for INPUT37SELECT Register" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="INPUT38SELECT" description="Lock bit for INPUT38SELECT Register" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="INPUT39SELECT" description="Lock bit for INPUT39SELECT Register" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="INPUT40SELECT" description="Lock bit for INPUT40SELECT Register" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="INPUT41SELECT" description="Lock bit for INPUT41SELECT Register" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="INPUT42SELECT" description="Lock bit for INPUT42SELECT Register" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="INPUT43SELECT" description="Lock bit for INPUT43SELECT Register" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="INPUT44SELECT" description="Lock bit for INPUT44SELECT Register" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="INPUT45SELECT" description="Lock bit for INPUT45SELECT Register" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="INPUT46SELECT" description="Lock bit for INPUT46SELECT Register" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="INPUT47SELECT" description="Lock bit for INPUT47SELECT Register" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="INPUT48SELECT" description="Lock bit for INPUT48SELECT Register" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="INPUT49SELECT" description="Lock bit for INPUT49SELECT Register" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="INPUT50SELECT" description="Lock bit for INPUT50SELECT Register" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="INPUT51SELECT" description="Lock bit for INPUT51SELECT Register" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="INPUT52SELECT" description="Lock bit for INPUT52SELECT Register" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="INPUT53SELECT" description="Lock bit for INPUT53SELECT Register" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="INPUT54SELECT" description="Lock bit for INPUT54SELECT Register" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="INPUT55SELECT" description="Lock bit for INPUT55SELECT Register" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="INPUT56SELECT" description="Lock bit for INPUT56SELECT Register" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="INPUT57SELECT" description="Lock bit for INPUT57SELECT Register" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="INPUT58SELECT" description="Lock bit for INPUT58SELECT Register" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="INPUT59SELECT" description="Lock bit for INPUT59SELECT Register" begin="26" end="26" width="1" rwaccess="RW"/>
		<bitfield id="INPUT60SELECT" description="Lock bit for INPUT60SELECT Register" begin="27" end="27" width="1" rwaccess="RW"/>
		<bitfield id="INPUT61SELECT" description="Lock bit for INPUT61SELECT Register" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="INPUT62SELECT" description="Lock bit for INPUT62SELECT Register" begin="29" end="29" width="1" rwaccess="RW"/>
		<bitfield id="INPUT63SELECT" description="Lock bit for INPUT63SELECT Register" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="INPUT64SELECT" description="Lock bit for INPUT64SELECT Register" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
</module>
